In [1]:
import numpy as np
import pandas as pd

In [13]:
r_c = pd.DataFrame([[1,3,4],[5,6,7,8]],columns = ["a","b","c","d"] , index = ["A","B"])

In [14]:
r_c

   a  b  c    d
A  1  3  4  NaN
B  5  6  7  8.0

In [30]:
student = [
    
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",},
    {"Name":"Ali","Fname":"Omer","FinalMarks":80,"Grade":"A",}
    ]

In [31]:
student_df = pd.DataFrame(student)

In [32]:
student_df

   Name Fname  FinalMarks Grade
0   Ali  Omer          80     A
1   Ali  Omer          80     A
2   Ali  Omer          80     A
3   Ali  Omer          80     A
4   Ali  Omer          80     A
5   Ali  Omer          80     A
6   Ali  Omer          80     A
7   Ali  Omer          80     A
8   Ali  Omer          80     A
9   Ali  Omer          80     A
10  Ali  Omer          80     A
11  Ali  Omer          80     A
12  Ali  Omer          80     A
13  Ali  Omer          80     A
14  Ali  Omer          80     A
15  Ali  Omer          80     A
16  Ali  Omer          80     A
17  Ali  Omer          80     A
18  Ali  Omer          80     A
19  Ali  Omer          80     A

In [33]:
student_df.shape

(20, 4)

In [4]:
import numpy as np
import pandas as pd
customer_file = pd.read_csv("muneeb/customers.csv")
customer_file_columns = customer_file[:0]
customer_file_columns = customer_file[0:,:]

In [28]:
customer_file[:0]
customer_file

  customer_id   name  age gender         city
6       C0007  James   56   Male  South Stacy

In [11]:
customer_file

    customer_id       name  age  gender               city
0         C0001   Jennifer   56    Male      Morrisonmouth
1         C0002    William   46    Male  Port Charlesshire
2         C0003      Ellen   32    Male  South Thomasmouth
3         C0004      Sheri   60    Male         West Megan
4         C0005     Taylor   25    Male         Josephland
..          ...        ...  ...     ...                ...
495       C0496  Stephanie   37    Male         Santosport
496       C0497      Susan   41    Male           Annaside
497       C0498    Spencer   29  Female         Harrisside
498       C0499     Rachel   52    Male       Anthonymouth
499       C0500    Jasmine   50    Male         North Mark

[500 rows x 5 columns]